"About ThumbsUp" = "About ThumbsUp";
"Check for Updates" = "Check for Updates";
"Preferences..." = "Preferences...";
"Services" = "Services";
"Hide ThumbsUp" = "Hide ThumbsUp";
"Hide Others" = "Hide Others";
"Show All" = "Show All";
"Quit ThumbsUp" = "Quit ThumbsUp";
"Edit" = "Edit";
"Undo" = "Undo";
"Redo" = "Redo";
"Cut" = "Cut";
"Copy" = "Copy";
"Paste" = "Paste";
"Delete" = "Delete";
"Select All" = "Select All";
"Window" = "Window";
"Close Window" = "Close Window";
"Close All" = "Close All";
"Zoom Window" = "Zoom Window";
"Minimize Window" = "Minimize Window";
"Bring All to Front" = "Bring All to Front";
"Help" = "Help";
"ThumbsUp Help" = "ThumbsUp Help";
"Preferences" = "Preferences";

"General" = "General";
"Extension:" = "Extension:";
"Name:" = "Name:";
"Prefix" = "Prefix";
"Suffix" = "Suffix";
"Folder" = "Folder";
"Format:" = "Format:";
"Quit when done" = "Quit when done";

"Create..." = "Create...";
"Thumbnails" = "Thumbnails";
"Thumbnails with Icons" = "Thumbnails with Icons";
"Icons for Originals" = "Icons for Originals";

"Sizing" = "Sizing";
"Limit:" = "Limit:";
"Scale:" = "Scale:";
"Percent" = "percent";
"pixels" = "pixels";

"Compression & Quality" = "Compression & Quality";
"Antialiasing:" = "Antialiasing:";
"None" = "None";
"Low" = "Low";
"High" = "High";
"Sharpen:" = "Sharpen:";
"Off" = "Off";
"Light" = "Light";
"Medium" = "Medium";
"Strong" = "Strong";

"Forum" = "User Forum";
"Feedback" = "Contact us";
"Release Notes" = "Release Notes";